vllm_qwen235b/fp8/in-1000-out-1000-max-concurrency-256-tp8.log
INFO 12-15 11:53:47 [__init__.py:241] Automatically detected platform rocm.
[aiter] import [module_aiter_enum] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_aiter_enum.so
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7448278e7f60>, seed=123, num_prompts=1280, dataset_name='random', no_stream=False, dataset_path=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1000, random_output_len=1000, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='localhost', port=8899, endpoint='/v1/completions', max_concurrency=256, model='/shared/amdgpu/home/share/Qwen/models--Qwen--Qwen3-235B-A22B-Instruct-2507-FP8/snapshots/e156cb4efae43fbee1a1ab073f946a1377e6b969', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-15 11:53:50 [datasets.py:509] Sampling input_len from [1000, 1000] and output_len from [1000, 1000]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:31 elapsed, 4815:16:44 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 1280/1280 [03:45<00:00,  5.67it/s]
============ Serving Benchmark Result ============
Successful requests:                     1280      
Maximum request concurrency:             256       
Benchmark duration (s):                  225.67    
Total input tokens:                      1277870   
Total generated tokens:                  1280000   
Request throughput (req/s):              5.67      
Output token throughput (tok/s):         5672.02   
Total Token throughput (tok/s):          11334.60  
---------------Time to First Token----------------
Mean TTFT (ms):                          3046.25   
Median TTFT (ms):                        3156.04   
P99 TTFT (ms):                           7270.63   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          42.10     
Median TPOT (ms):                        42.13     
P99 TPOT (ms):                           44.62     
---------------Inter-token Latency----------------
Mean ITL (ms):                           42.10     
Median ITL (ms):                         37.74     
P99 ITL (ms):                            44.44     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          45100.09  
Median E2EL (ms):                        45234.61  
P99 E2EL (ms):                           48526.46  
==================================================